# Case Study on Regression

In [25]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

##The given dataset contains price of second-hand Hyundai grand i10 car with
respect to year of making. Find the best linear relationship between year and
price. Can you predict the possible price of a 2022 model second-hand grand i10?
Please learn about lasso regression and create a model along with linear
regression. Find out which one is performing better.

In [26]:
#Reading dataset
H_car=pd.read_csv(r'D:\OneDrive\Desktop\ARYA DSA/car_age_price.csv')

In [27]:
#Inspect data,print top 5
H_car.head()

   Year   Price
0  2018  465000
1  2019  755000
2  2019  700000
3  2018  465000
4  2018  465000

In [28]:
#print bottom 5
H_car.tail()

     Year   Price
107  2016  375000
108  2014  300000
109  2015  425000
110  2016  420000
111  2015  425000

In [29]:
#Get size of dataset
H_car.shape

(112, 2)

In [30]:
#Finding missing values
H_car.isna().sum()

Year     0
Price    0
dtype: int64

In [31]:
#Processing Years to Derive Age of car
H_car['Current_year']=2022
H_car['Ageofcar']=H_car['Current_year']-H_car['Year']
H_car.drop('Current_year',axis=1,inplace=True)
H_car.head()

   Year   Price  Ageofcar
0  2018  465000         4
1  2019  755000         3
2  2019  700000         3
3  2018  465000         4
4  2018  465000         4

In [32]:
H_car.tail()

     Year   Price  Ageofcar
107  2016  375000         6
108  2014  300000         8
109  2015  425000         7
110  2016  420000         6
111  2015  425000         7

In [33]:
H_car.describe()

              Year          Price    Ageofcar
count   112.000000     112.000000  112.000000
mean   2016.669643  483866.044643    5.330357
std       1.629616   91217.450533    1.629616
min    2013.000000  300000.000000    2.000000
25%    2015.000000  423750.000000    5.000000
50%    2017.000000  500000.000000    5.000000
75%    2017.000000  550000.000000    7.000000
max    2020.000000  755000.000000    9.000000

##Observation
Year ranges from 2013-2020.Age of the car ranges from 2- 9 years
Price is 7.55 laks for the used cars

In [35]:
from sklearn.model_selection import train_test_split 
 
X = H_car.drop('Price', 1) 
Y = H_car.Price 
X_train, X_test, y_train, y_test = train_test_split( X, Y, train_size=0.7, test_size=0.3, random_state=100)

C:\Users\bhask\AppData\Local\Temp\ipykernel_15032\3590489204.py:3: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  X = H_car.drop('Price', 1)

In [36]:
from sklearn import linear_model 
from sklearn.metrics import r2_score 
 
lm = linear_model.LinearRegression() 
lm.fit(X_train, y_train) 
y_pred = lm.predict(X_test) 
print(r2_score(y_true=y_test, y_pred=y_pred))

0.6094983457032859